Terraform Plan Output:
```
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Reading...
module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/lambda/hello-kitty-function-sky2705]
module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this: Refreshing state... [id=sky2705-hello-kitty-role]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this: Refreshing state... [id=skyindustries2705]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=a3afb5ad-717d-400e-a3be-5141be8199f2]
module.appcd_173ea410-c541-41e6-a24c-ca01140bbf55.aws_iam_role_policy.this: Refreshing state... [id=sky2705-hello-kitty-role:Writer]
module.appcd_72f98e06-a44f-4154-812c-07f8fcfecbfa.aws_iam_role_policy.this: Refreshing state... [id=sky2705-hello-kitty-role:skyindustries2705aws_s3-hello-kitty-policy]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this: Refreshing state... [id=sky2705-hello-kitty-function]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=skyindustries2705]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this: Refreshing state... [id=skyindustries2705]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=skyindustries2705]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0]: Refreshing state... [id=alias/s3-skyindustries2705]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this must be replaced
-/+ resource "aws_lambda_function" "this" {
      ~ arn                            = "arn:aws:lambda:us-west-2:222634395437:function:sky2705-hello-kitty-function" -> (known after apply)
      ~ code_sha256                    = "ThpXeTZobED3ATPn7m4pXZIgyOEqiZM/qo5OX/My6zE=" -> (known after apply)
      ~ function_name                  = "sky2705-hello-kitty-function" -> "hello-kitty-function-skyjaiswal2705" # forces replacement
      ~ id                             = "sky2705-hello-kitty-function" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:sky2705-hello-kitty-function/invocations" -> (known after apply)
      ~ last_modified                  = "2024-09-28T09:51:36.813+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:222634395437:function:sky2705-hello-kitty-function:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:sky2705-hello-kitty-function:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::222634395437:role/sky2705-hello-kitty-role" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 2168 -> (known after apply)
      ~ tags                           = {
          ~ "appstack"  = "sky2705" -> "skyapplicationhellokitty"
            "component" = "hello-kitty"
        }
      ~ tags_all                       = {
          ~ "appstack"  = "sky2705" -> "skyapplicationhellokitty"
            # (1 unchanged element hidden)
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "IMAGES_BUCKET" = "skyIndustries2705" -> "skyjaiswal2705"
            }
        }

      ~ ephemeral_storage (known after apply)
      - ephemeral_storage {
          - size = 512 -> null
        }

      ~ logging_config (known after apply)
      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/sky2705-hello-kitty-function" -> null
            # (2 unchanged attributes hidden)
        }

      ~ tracing_config (known after apply)
      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0] will be created
  + resource "aws_lambda_function_url" "this" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "hello-kitty-function-skyjaiswal2705"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + url_id             = (known after apply)
    }

  # module.appcd_173ea410-c541-41e6-a24c-ca01140bbf55.aws_iam_role_policy.this will be destroyed
  # (because aws_iam_role_policy.this is not in configuration)
  - resource "aws_iam_role_policy" "this" {
      - id          = "sky2705-hello-kitty-role:Writer" -> null
      - name        = "Writer" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-sky2705",
                        ]
                      - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e50"
                    },
                  - {
                      - Action   = [
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-sky2705:*",
                        ]
                      - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e51"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "sky2705-hello-kitty-role" -> null
        # (1 unchanged attribute hidden)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0] must be replaced
-/+ resource "aws_kms_alias" "a" {
      ~ arn            = "arn:aws:kms:us-west-2:222634395437:alias/s3-skyindustries2705" -> (known after apply)
      ~ id             = "alias/s3-skyindustries2705" -> (known after apply)
      ~ name           = "alias/s3-skyindustries2705" -> "alias/s3-skyjaiswal2705" # forces replacement
      + name_prefix    = (known after apply)
      ~ target_key_arn = "arn:aws:kms:us-west-2:222634395437:key/a3afb5ad-717d-400e-a3be-5141be8199f2" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this must be replaced
-/+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::skyindustries2705" -> (known after apply)
      ~ bucket                      = "skyindustries2705" -> "skyjaiswal2705" # forces replacement
      ~ bucket_domain_name          = "skyindustries2705.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "skyindustries2705.s3.us-west-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3BJ6K6RIION7M" -> (known after apply)
      ~ id                          = "skyindustries2705" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-west-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          ~ "appstack"  = "sky2705" -> "skyapplicationhellokitty"
            "component" = "hello-kitty"
        }
      ~ tags_all                    = {
          ~ "appstack"  = "sky2705" -> "skyapplicationhellokitty"
            # (1 unchanged element hidden)
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "142ffdd1f87132a598f0ca276babbb31f1f8672261731ae3635f0b84be07a341" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "a3afb5ad-717d-400e-a3be-5141be8199f2" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "skyindustries2705" -> (known after apply) # forces replacement
      ~ id                      = "skyindustries2705" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0] must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      ~ bucket                = "skyindustries2705" -> (known after apply) # forces replacement
      ~ id                    = "skyindustries2705" -> (known after apply)
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - kms_master_key_id = "a3afb5ad-717d-400e-a3be-5141be8199f2" -> null
              - sse_algorithm     = "aws:kms" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "a3afb5ad-717d-400e-a3be-5141be8199f2"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0] must be replaced
-/+ resource "aws_s3_bucket_versioning" "this" {
      ~ bucket                = "skyindustries2705" -> (known after apply) # forces replacement
      ~ id                    = "skyindustries2705" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.appcd_72f98e06-a44f-4154-812c-07f8fcfecbfa.aws_iam_role_policy.this will be destroyed
  # (because aws_iam_role_policy.this is not in configuration)
  - resource "aws_iam_role_policy" "this" {
      - id          = "sky2705-hello-kitty-role:skyindustries2705aws_s3-hello-kitty-policy" -> null
      - name        = "skyindustries2705aws_s3-hello-kitty-policy" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "kms:Decrypt",
                          - "kms:Encrypt",
                          - "kms:GenerateDataKey",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:kms:us-west-2:222634395437:key/a3afb5ad-717d-400e-a3be-5141be8199f2",
                        ]
                      - Sid      = "AllowKmsAccess"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetObjectVersion",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::skyindustries2705",
                          - "arn:aws:s3:::skyindustries2705/*",
                        ]
                      - Sid      = "hellokittyIMAGESBUCKETS3Bucket551e1d2b88ec540687cfc51521bbe894"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "sky2705-hello-kitty-role" -> null
        # (1 unchanged attribute hidden)
    }

  # module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this must be replaced
-/+ resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-sky2705" -> (known after apply)
      ~ id                = "/aws/lambda/hello-kitty-function-sky2705" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/hello-kitty-function-sky2705" -> "/aws/lambda/hello-kitty-function-skyjaiswal2705" # forces replacement
      + name_prefix       = (known after apply)
      ~ tags              = {
          ~ "appstack"  = "sky2705" -> "skyapplicationhellokitty"
            "component" = "hello-kitty"
        }
      ~ tags_all          = {
          ~ "appstack"  = "sky2705" -> "skyapplicationhellokitty"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.appcd_88fbaabd-45e0-470a-b678-013ebc7a0660.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "Writer"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "hello-kitty-role"
    }

  # module.appcd_b3d4f5a6-4342-4ee5-8b34-f712883a908b.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "aws_s3-hello-kitty-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "hello-kitty-role"
    }

  # module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this must be replaced
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::222634395437:role/sky2705-hello-kitty-role" -> (known after apply)
      ~ create_date           = "2024-09-28T09:51:27Z" -> (known after apply)
      ~ id                    = "sky2705-hello-kitty-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "sky2705-hello-kitty-role" -> "hello-kitty-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {
          - "appstack"  = "sky2705"
          - "component" = "hello-kitty"
        } -> null
      ~ tags_all              = {
          - "appstack"  = "sky2705"
          - "component" = "hello-kitty"
        } -> (known after apply)
      ~ unique_id             = "AROATHVQLI4WX3FOYWJEE" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ inline_policy (known after apply)
      - inline_policy {
          - name   = "Writer" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-sky2705",
                            ]
                          - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e50"
                        },
                      - {
                          - Action   = [
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvents",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-sky2705:*",
                            ]
                          - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e51"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "skyindustries2705aws_s3-hello-kitty-policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "kms:Decrypt",
                              - "kms:Encrypt",
                              - "kms:GenerateDataKey",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:kms:us-west-2:222634395437:key/a3afb5ad-717d-400e-a3be-5141be8199f2",
                            ]
                          - Sid      = "AllowKmsAccess"
                        },
                      - {
                          - Action   = [
                              - "s3:PutObject",
                              - "s3:ListBucket",
                              - "s3:GetObject",
                              - "s3:GetObjectVersion",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::skyindustries2705",
                              - "arn:aws:s3:::skyindustries2705/*",
                            ]
                          - Sid      = "hellokittyIMAGESBUCKETS3Bucket551e1d2b88ec540687cfc51521bbe894"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

Plan: 11 to add, 0 to change, 10 to destroy.

Changes to Outputs:
  - aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_sky2705_arn         = "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-sky2705" -> null
  - aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_sky2705_name        = "/aws/lambda/hello-kitty-function-sky2705" -> null
  + aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_skyjaiswal2705_arn  = (known after apply)
  + aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_skyjaiswal2705_name = "/aws/lambda/hello-kitty-function-skyjaiswal2705"
  + aws_iam_role_hello_kitty_role_arn                                            = (known after apply)
  + aws_iam_role_hello_kitty_role_name                                           = "hello-kitty-role"
  - aws_iam_role_sky2705_hello_kitty_role_arn                                    = "arn:aws:iam::222634395437:role/sky2705-hello-kitty-role" -> null
  - aws_iam_role_sky2705_hello_kitty_role_name                                   = "sky2705-hello-kitty-role" -> null
  + aws_lambda_hello_kitty_function_skyjaiswal2705_function_arn                  = (known after apply)
  + aws_lambda_hello_kitty_function_skyjaiswal2705_function_name                 = "hello-kitty-function-skyjaiswal2705"
  + aws_lambda_hello_kitty_function_skyjaiswal2705_function_url                  = (known after apply)
  + aws_lambda_hello_kitty_function_skyjaiswal2705_invoke_arn                    = (known after apply)
  - aws_lambda_sky2705_hello_kitty_function_function_arn                         = "arn:aws:lambda:us-west-2:222634395437:function:sky2705-hello-kitty-function" -> null
  - aws_lambda_sky2705_hello_kitty_function_function_name                        = "sky2705-hello-kitty-function" -> null
  - aws_lambda_sky2705_hello_kitty_function_invoke_arn                           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:sky2705-hello-kitty-function/invocations" -> null
  - aws_s3_skyindustries2705_arn                                                 = "arn:aws:s3:::skyindustries2705" -> null
  - aws_s3_skyindustries2705_bucket_name                                         = "skyindustries2705" -> null
  - aws_s3_skyindustries2705_kms_arn                                             = "arn:aws:kms:us-west-2:222634395437:key/a3afb5ad-717d-400e-a3be-5141be8199f2" -> null
  + aws_s3_skyjaiswal2705_arn                                                    = (known after apply)
  + aws_s3_skyjaiswal2705_bucket_name                                            = (known after apply)
  + aws_s3_skyjaiswal2705_kms_arn                                                = "arn:aws:kms:us-west-2:222634395437:key/a3afb5ad-717d-400e-a3be-5141be8199f2"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```